app/views/rooms/_room.html.erb

SELECT "device_rooms".* FROM "device_rooms" WHERE "device_rooms"."room_id" = $1  [["room_id", 1]]
---
				<h4>Devices</h4>
				<% room.device_rooms.each do |device_room| %>

SELECT "people".* FROM "people" WHERE "people"."room_id" = $1  [["room_id", 1]]
---
				<h4>People</h4>
				<% room.people.each do |person| %>

SELECT "stuffs".* FROM "stuffs" WHERE "stuffs"."room_id" = $1  [["room_id", 1]]
---
				<h4>Stuff</h4>
				<% room.stuffs.each do |stuff| %>