app/views/rooms/index.html.erb

SELECT "rooms".* FROM "rooms"
SELECT COUNT(*) FROM "rooms"
---
						<h2>Choose what you want to add on the top right corner</h2>
						<% if Room.all.empty? %>

SELECT "organizations".* FROM "organizations"
---
						<div id="organizations">
							<% Organization.all.each do |organization| %>