app/views/rooms/index.js.erb

	$("#rooms").append("<%= escape_javascript(render(@room)) %>");
	$("select#person_room_id").html("<%= escape_javascript(options_from_collection_for_select(Room.all, 'id', 'name')) %>");
---
SELECT "rooms".* FROM "rooms"