app/controllers/rooms_controller.rb

SELECT "rooms".* FROM "rooms"
---
  def index
    @logs = Log.where("created_at > ? and kind !=2 and kind !=3", Simulation.last ? Simulation.last.created_at : Time.now)
    @rooms = Room.all

SELECT "rooms".* FROM "rooms"
INSERT INTO "rooms" ("created_at", "name", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", Wed, 18 Dec 2013 18:05:17 UTC +00:00], ["name", "s"], ["updated_at", Wed, 18 Dec 2013 18:05:17 UTC +00:00]]
---
  def create
    @room = Room.new(room_params)
    @rooms = Room.all
    respond_to do |format|
      if @room.save

SELECT "simulations".* FROM "simulations" ORDER BY "simulations"."id" DESC LIMIT 1
---
    def set_simulation
      @simulation = Simulation.last