app/views/application/_add_device.html.erb

		<div class="form-group">
			<%= select_tag 'device_id', options_from_collection_for_select(Device.all.order(:name), 'id', 'name'), class: "form-control" %>
---
SELECT "devices".* FROM "devices" ORDER BY "devices".name ASC